(function(swim) {
  swim.data.pools = {
    paoyuekong: {
      venue: "包玉剛游泳池",
      address: ["香港黃竹坑深灣道2號"],
      enquiries: ["2553 3617，2555 0103 +"],
      facilities: [
        "主池、副池、*訓練池、習泳池(2)、跳水池、兒童池 、戲水池 、觀眾看台(600個座位)、電子計分板、家庭更衣室",
		    "殘疾人士專用設施：方便通往池面的無阻通道、更衣室、洗手間"
      ],
      opening_schedule: [
        "夏季（4月至10月)",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至6時",
        "第三節：晚上7時至10時",
        "(暫停開放時段：中午12時至下午1時；下午6時至下午7時)"
      ],
      temporary_closure_for_annual_maintenance: ["11月1日至翌年3月31日"],
      weekly_cleansing_day: [
        "逢周二",
        "(如每周大清潔日適逢公眾假期，游泳池會照常開放，而大清潔行動將安排在同周的周一進行)"
      ],
      notes: [
        "#	戶外暖水游泳池",
        "^ 	室內暖水游泳池",
        "+ 	辦公時間內 (地區康樂事務辦事處)",
        "() 	設施的數目",
        "* 	設有專供殘疾人士使用的升降台 "
      ]
    },
    kennedytown: {
      venue: "堅尼地城游泳池",
      address: ["香港堅尼地城西祥街北2號"],
      enquiries: ["2817 7973，2817 4504 +"],
      facilities: [
        "*副池、嬉水池、家庭更衣室",
		    "殘疾人士專用設施: 方便通往池面的無阻通道、更衣室、洗手間"
      ],
      opening_schedule: [
        "夏季（4月至10月)",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至5時",
        "第三節：晚上6時至10時",
        "(暫停開放時段：中午12時至下午1時；下午5時至下午6時)",
        "冬季 (11月)",
        "上午6時30分至中午12時"
      ],
      temporary_closure_for_annual_maintenance: ["12月1日至翌年3月31日"],
      weekly_cleansing_day: [
        "逢周三",
        "(如每周大清潔日適逢公眾假期，游泳池會照常開放，而大清潔行動將安排在同周的周四進行)"
      ],
      notes: [
        "#	戶外暖水游泳池",
        "^ 	室內暖水游泳池",
        "+ 	辦公時間內 (地區康樂事務辦事處)",
        "() 	設施的數目",
        "* 	設有專供殘疾人士使用的升降台 "
      ]
    },
    sunyatsen: {
      venue: "中山紀念公園游泳池",
      address: ["香港西營盤東邊街北16號"],
      enquiries: ["2540 6708，2853 2566 +"],
      facilities: [
        "室內設施: 主池、訓練池、觀眾看台(1000個座位)、",
		    "電子計分板、家庭更衣室",
        "殘疾人士專用設施: 方便通往池面的無阻通道、更衣室、洗手間"
      ],
      opening_schedule: [
        "夏季（4月至10月)",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至5時",
        "第三節：晚上6時至10時",
        "(暫停開放時段：中午12時至下午1時；下午5時至下午6時)",
        "冬季 (11月至3月^) ",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至5時",
        "第三節：晚上6時至10時",
        "(暫停開放時段：中午12時至下午1時；下午5時至下午6時)"
      ],
      temporary_closure_for_annual_maintenance: ["待定"],
      weekly_cleansing_day: [
        "逢周二",
        "(如每周大清潔日適逢公眾假期，游泳池會照常開放，而大清潔行動將安排在同周的周五進行)"
      ],
      notes: [
        "#	戶外暖水游泳池",
        "^ 	室內暖水游泳池",
        "+ 	辦公時間內 (地區康樂事務辦事處)",
        "() 	設施的數目",
        "* 	設有專供殘疾人士使用的升降台 "
      ]
    },
    morrisonhill: {
      venue: "摩理臣山游泳池",
      address: ["香港灣仔愛群道7號"],
      enquiries: ["2575 3028，2879 5622 +"],
      facilities: [
        "室內設施: *主池、訓練池、觀眾看台(203個座位)、電子計分板",
        "室外設施: 習泳池、幼童池",
        "殘疾人士專用設施: 方便通往池面的無阻通道、更衣室、洗手間"
      ],
      opening_schedule: [
        "夏季（4月至10月)",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至5時",
        "第三節：晚上6時至10時",
        "(暫停開放時段：中午12時至下午1時；下午5時至下午6時)",
        "冬季 (11月至3月^) ",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至5時",
        "第三節：晚上6時至10時",
        "(暫停開放時段：中午12時至下午1時；下午5時至下午6時)"
      ],
      temporary_closure_for_annual_maintenance: ["5月1日至6月30日"],
      weekly_cleansing_day: [
        "逢周四",
        "(如每周大清潔日適逢公眾假期，游泳池會照常開放，大清潔行動將安排在同周的周三進行)"
      ],
      notes: [
        "#	戶外暖水游泳池",
        "^ 	室內暖水游泳池",
        "+ 	辦公時間內 (地區康樂事務辦事處)",
        "() 	設施的數目",
        "* 	設有專供殘疾人士使用的升降台 "
      ]
    },
    wanchai: {
      venue: "灣仔游泳池",
      address: ["香港灣仔港灣道27號"],
      enquiries: ["2827 5240，2879 5622 +"],
      facilities: [
        "*主池、電子計分板、觀眾看台(100個座位)",
        "殘疾人士專用設施: 方便通往池面的無阻通道、更衣室、洗手間"
      ],
      opening_schedule: [
        "夏季（4月至10月)",
        "上午7時至晚上10時 ",
        "冬季 (11月至3月 #) ",
        "上午7時至晚上10時"
      ],
      temporary_closure_for_annual_maintenance: ["2011年12月14日至2012年1月20日"],
      weekly_cleansing_day: [
        "逢周五 (上午10時至下午4時)"
      ],
      notes: [
        "#	戶外暖水游泳池",
        "^ 	室內暖水游泳池",
        "+ 	辦公時間內 (地區康樂事務辦事處)",
        "() 	設施的數目",
        "* 	設有專供殘疾人士使用的升降台 "
      ]
    },
    chaiwan: {
      venue: "柴灣游泳池",
      address: ["香港柴灣新廈街345號"],
      enquiries: ["2558 3538"],
      facilities: [
        "主池、副池、訓練池、*習泳池(1)、習泳池(1)、跳水池、嬉水池(3)、觀眾看台(800個座位)、家庭更衣室 ",
        "殘疾人士專用設施: 方便通往池面的無阻通道、更衣室、洗手間"
      ],
      opening_schedule: [
        "夏季（4月至10月)",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至5時",
        "第三節：晚上6時至10時",
        "(暫停開放時段：中午12時至下午1時；下午5時至下午6時)"
      ],
      temporary_closure_for_annual_maintenance: ["11月1日至翌年3月31日"],
      weekly_cleansing_day: [
        "逢周二",
        "(如每周大清潔日適逢公眾假期，游泳池會照常開放，而大清潔行動將安排在同周的周四進行)"
      ],
      notes: [
        "#	戶外暖水游泳池",
        "^ 	室內暖水游泳池",
        "+ 	辦公時間內 (地區康樂事務辦事處)",
        "() 	設施的數目",
        "* 	設有專供殘疾人士使用的升降台 "
      ]
    },
    victoriapark: {
      venue: "維多利亞公園游泳池",
      address: ["香港銅鑼灣興發街維多利亞公園"],
      enquiries: ["2570 8347"],
      facilities: [
        "主池、訓練池、跳水池、兒童池、戲水池、觀眾看台(1700個座位)、電子計分板 "
      ],
      opening_schedule: [
        "夏季（4月至10月)",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至5時",
        "第三節：晚上6時至10時",
        "(暫停開放時段：中午12時至下午1時；下午5時至下午6時)",
        "冬季 (11月至3月^) ",
        "上午6時30分至中午12時"
      ],
      temporary_closure_for_annual_maintenance: ["12月1日至翌年3月31日"],
      weekly_cleansing_day: [
        "逢周一",
        "(如每周大清潔日適逢公眾假期，游泳池會照常開放，而大清潔行動將安排在同周的周五進行)"
      ],
      notes: [
        "#	戶外暖水游泳池",
        "^ 	室內暖水游泳池",
        "+ 	辦公時間內 (地區康樂事務辦事處)",
        "() 	設施的數目",
        "* 	設有專供殘疾人士使用的升降台 "
      ]
    },
    islandeast: {
      venue: "港島東游泳池",
      address: ["香港西灣河鯉景道52號"],
      enquiries: ["2151 4082"],
      facilities: [
        "室內設施: *訓練池、戲水池、嬉水池、家庭更衣室",
        "殘疾人士專用設施: 方便通往池面的無阻通道、更衣室、洗手間"
      ],
      opening_schedule: [
        "夏季（4月至10月)",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至5時",
        "第三節：晚上6時至10時",
        "(暫停開放時段：中午12時至下午1時；下午5時至下午6時)",
        "冬季 (11月至3月^) ",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至5時",
        "第三節：晚上6時至9時",
        "(暫停開放時段：中午12時至下午1時；下午5時至下午6時)"
      ],
      temporary_closure_for_annual_maintenance: ["2012年9月12日至12月31日",
        "( 進行更換嬉水設施及每年維修工程。)"],
      weekly_cleansing_day: [
        "逢周三 ",
        "(如每周大清潔日適逢公眾假期，游泳池會照常開放，大清潔行動將安排在同周的周五進行)"
      ],
      notes: [
        "#	戶外暖水游泳池",
        "^ 	室內暖水游泳池",
        "+ 	辦公時間內 (地區康樂事務辦事處)",
        "() 	設施的數目",
        "* 	設有專供殘疾人士使用的升降台 "
      ]
    },
    siusaiwan: {
      venue: "小西灣游泳池",
      address: ["香港小西灣道15號小西灣綜合大樓一樓"],
      enquiries: ["3427 3341"],
      facilities: [
        "室內設施: 訓練池 (1)、*訓練池 (1)、家庭更衣室",
        "殘疾人士專用設施: 方便通往池面的無阻通道、更衣室、洗手間"
      ],
      opening_schedule: [
        "夏季（4月至10月)",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至5時",
        "第三節：晚上6時至10時",
        "(暫停開放時段：中午12時至下午1時；下午5時至下午6時)",
        "冬季 (11月至3月^) ",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至5時",
        "第三節：晚上6時至9時",
        "(暫停開放時段：中午12時至下午1時；下午5時至下午6時)"
      ],
      temporary_closure_for_annual_maintenance: ["4月16日至5月31日",
        "( 進行更換嬉水設施及每年維修工程。)"],
      weekly_cleansing_day: [
        "逢周四",
        "(如每周大清潔日適逢公眾假期，游泳池會照常開放，大清潔行動將安排在同周的周一進行)"
      ],
      notes: [
        "#	戶外暖水游泳池",
        "^ 	室內暖水游泳池",
        "+ 	辦公時間內 (地區康樂事務辦事處)",
        "() 	設施的數目",
        "* 	設有專供殘疾人士使用的升降台 "
      ]
    },
    laichikokpark: {
      venue: "荔枝角公園游泳池",
      address: ["九龍荔枝角荔灣道1號"],
      enquiries: ["32745 5234，2386 0945 +"],
      facilities: [
        "主池、副池、訓練池、*習泳池(1)、習泳池(1)、跳水池、戲水池、觀眾看台(800個座位)、電子計分板、家庭更衣室",
        "殘疾人士專用設施: 方便通往池面的無阻通道、更衣室、洗手間"
      ],
      opening_schedule: [
        "夏季 (2011年 4月 至 10月) (只開放主池、訓練池、習泳池及戲水池) ",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至6時",
        "第三節：晚上7時至10時",
        "(暫停開放時段：中午12時至下午1時；下午6時至下午7時)",
        "冬季 (2011年 11月 至 2012年1月) (只開放主池)  ",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至6時",
        "第三節：晚上7時至9時",
        "(暫停開放時段：中午12時至下午1時；下午6時至下午7時)"
      ],
      temporary_closure_for_annual_maintenance: ["2011年11月至2012年1月期間",
        "副池、訓練池、習泳池、跳水池、戲水池暫停開放",
        "2012年2月 至6月期間",
        "全泳館將暫停開放，以進行改建副池為室內暖水池"],
      weekly_cleansing_day: [
        "逢周三",
        "(如每周大清潔日適逢公眾假期，游泳池會照常開放，而大清潔行動將安排在同周的周二進行)"
      ],
      notes: [
        "#	戶外暖水游泳池",
        "^ 	室內暖水游泳池",
        "+ 	辦公時間內 (地區康樂事務辦事處)",
        "() 	設施的數目",
        "* 	設有專供殘疾人士使用的升降台 "
      ]
    },
    leichenguk: {
      venue: "李鄭屋游泳池",
      address: ["九龍深水埗廣利道25號 "],
      enquiries: ["2387 4224，2386 0945 +"],
      facilities: [
        "主池、副池、*習泳池(1)、習泳池(2)、兒童池 、跳水池 、觀眾看台(700個座位)、家庭更衣室",
        "殘疾人士專用設施: 方便通往池面的無阻通道、更衣室、洗手間"
      ],
      opening_schedule: [
        "夏季（4月至10月)",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至6時",
        "第三節：晚上7時至10時",
        "(暫停開放時段：中午12時至下午1時；下午6時至下午7時)"
      ],
      temporary_closure_for_annual_maintenance: ["11月1日至翌年3月31日"],
      weekly_cleansing_day: [
        "逢周四",
        "(如每周大清潔日適逢公眾假期，游泳池會照常開放，而大清潔行動將安排在同周的周二進行)"
      ],
      notes: [
        "#	戶外暖水游泳池",
        "^ 	室內暖水游泳池",
        "+ 	辦公時間內 (地區康樂事務辦事處)",
        "() 	設施的數目",
        "* 	設有專供殘疾人士使用的升降台 "
      ]
    },
    shamshuipopark: {
      venue: "深水埗公園游泳池",
      address: ["九龍深水埗荔枝角道733號"],
      enquiries: ["2360 2329，2386 0945 +"],
      facilities: [
        "主池、副池、訓練池、習泳池(2)、跳水池、兒童池 、戲水池、觀眾看台(750個座位)、家庭更衣室",
        "殘疾人士專用設施: 方便通往池面的無阻通道、更衣室、洗手間"
      ],
      opening_schedule: [
        "夏季 2011年 4月 至 10月",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至6時",
        "第三節：晚上7時至10時",
        "(暫停開放時段：中午12時至下午1時；下午6時至下午7時)",
        "冬季 (2012年1月至3月) (只開放主池#)",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至6時",
        "第三節：晚上7時至9時 (2012年1月1日至30日期間，",
        "晚上第三節時段只供團體訓練之用",
        "(暫停開放時段：中午12時至下午1時；下午6時至下午7時)"
      ],
      temporary_closure_for_annual_maintenance: ["2011年11月至12月期間",
        "全泳館於暫停開放，以進行每年維修工程",
        "2012年1月至3月期間",
        "副池、訓練池、習泳池、跳水池、兒童池、戲水池暫停開放"],
      weekly_cleansing_day: [
        "逢周五 ",
        "(如每周大清潔日適逢公眾假期，游泳池會照常開放，而大清潔行動將安排在同周的周二進行) "
      ],
      notes: [
        "#	戶外暖水游泳池",
        "^ 	室內暖水游泳池",
        "+ 	辦公時間內 (地區康樂事務辦事處)",
        "() 	設施的數目",
        "* 	設有專供殘疾人士使用的升降台 "
      ]
    },
    kowloonpark: {
      venue: "九龍公園游泳池",
      address: ["九龍尖沙咀柯士甸道22號九龍公園"],
      enquiries: ["2724 3577，2724 3344 +"],
      facilities: [
        "室內設施: 主池、*訓練池(2)、跳水池、觀眾看台(1689個座位)、電子計分板、家庭更衣室",
        "室外設施: 戲水池、嬉水池(3)",
        "殘疾人士專用設施: 方便通往池面的無阻通道、更衣室、洗手間"
      ],
      opening_schedule: [
        "夏季（4月至10月)",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至5時",
        "第三節：晚6時至10時",
        "(暫停開放時段：中午12時至下午1時；下午5時至下午6時)",
        "冬季 (11月至3月) (只開放室內游泳池^ )",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至5時",
        "第三節：晚6時至10時",
        "(暫停開放時段：中午12時至下午1時；下午5時至下午6時)"
      ],
      temporary_closure_for_annual_maintenance: ["室內泳池﹕ 4月1日至5月31日",
        "戶外泳池﹕ 11月1日至翌年3月31日"],
      weekly_cleansing_day: [
        "逢周二",
        "(如每周大清潔日適逢公眾假期，游泳池會照常開放，而大清潔行動將安排在同周的周四進行) "
      ],
      notes: [
        "#	戶外暖水游泳池",
        "^ 	室內暖水游泳池",
        "+ 	辦公時間內 (地區康樂事務辦事處)",
        "() 	設施的數目",
        "* 	設有專供殘疾人士使用的升降台 "
      ]
    },
    taikoktsui: {
      venue: "大角咀游泳池",
      address: ["九龍大角咀福全街63號大角咀市政大廈4樓 "],
      enquiries: ["2393 1237，2302 1762+"],
      facilities: [
        "室內設施: *訓練池、嬉水池、家庭更衣室 ",
        "殘疾人士專用設施: 方便通往池面的無阻通道、更衣室、洗手間"
      ],
      opening_schedule: [
        "夏季（4月至10月",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至5時",
        "第三節：晚6時至10時",
        "(暫停開放時段：中午12時至下午1時；下午5時至下午6時)",
        "冬季 (11月至3月^)",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至5時",
        "第三節：晚6時至10時",
        "(暫停開放時段：中午12時至下午1時；下午5時至下午6時)"
      ],
      temporary_closure_for_annual_maintenance: ["9月12日至10月31日"],
      weekly_cleansing_day: [
        "逢周一",
        "(如每周大清潔日適逢公眾假期，游泳池會照常開放，而大清潔行動將安排在同周的周三進行) "
      ],
      notes: [
        "#	戶外暖水游泳池",
        "^ 	室內暖水游泳池",
        "+ 	辦公時間內 (地區康樂事務辦事處)",
        "() 	設施的數目",
        "* 	設有專供殘疾人士使用的升降台 "
      ]
    },
    taiwanshan: {
      venue: "大環山游泳池",
      address: ["九龍紅磡環海街7號"],
      enquiries: ["2333 1335，2762 2084 +"],
      facilities: [
        "主池、*副池、習泳池(3)、跳水池、嬉水池(3)、觀眾看台(800個座位)、電子計分板、家庭更衣室",
        "殘疾人士專用設施: 方便通往池面的無阻通道、更衣室、洗手間"
      ],
      opening_schedule: [
        "夏季（4月至10月",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至5時",
        "第三節：晚6時至10時",
        "(暫停開放時段：中午12時至下午1時；下午5時至下午6時)"
      ],
      temporary_closure_for_annual_maintenance: ["11月1日至翌年3月31日"],
      weekly_cleansing_day: [
        "逢周四",
        "(如每周大清潔日適逢公眾假期，游泳池會照常開放，而大清潔行動將安排在同周的周五進行) "
      ],
      notes: [
        "#	戶外暖水游泳池",
        "^ 	室內暖水游泳池",
        "+ 	辦公時間內 (地區康樂事務辦事處)",
        "() 	設施的數目",
        "* 	設有專供殘疾人士使用的升降台 "
      ]
    },
    homantin: {
      venue: "何文田游泳池",
      address: ["九龍何文田忠義街1號"],
      enquiries: ["2715 0139，2762 2084 +"],
      facilities: [
        "室內設施: 嬉水池(2)、家庭更衣室 ",
        "室外設施: 嬉水池(2)",
        "殘疾人士專用設施: 方便通往池面的無阻通道、更衣室、洗手間"
      ],
      opening_schedule: [
        "夏季（4月至10月",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至5時",
        "第三節：晚6時至10時",
        "(暫停開放時段：中午12時至下午1時；下午5時至下午6時)",
        "冬季 (11月至3月) (只開放室內游泳池^) ",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至5時",
        "第三節：晚6時至9時",
        "(暫停開放時段：中午12時至下午1時；下午5時至下午6時)"
      ],
      temporary_closure_for_annual_maintenance: ["室內游泳池：9月12日至10月31日 ",
        "室外游泳池：9月12日至翌年3月31日 "],
      weekly_cleansing_day: [
        "逢周三",
        "(如每周大清潔日適逢公眾假期，游泳池會照常開放，而大清潔行動將安排在同周的周二進行) "
      ],
      notes: [
        "#	戶外暖水游泳池",
        "^ 	室內暖水游泳池",
        "+ 	辦公時間內 (地區康樂事務辦事處)",
        "() 	設施的數目",
        "* 	設有專供殘疾人士使用的升降台 "
      ]
    },
    kowloontsai: {
      venue: "九龍仔游泳池",
      address: ["九龍延文禮士道13號九龍仔公園"],
      enquiries: ["2336 5817，2762 2084 +"],
      facilities: [
        "主池、嬉水池、兒童池、觀眾看台(1000個座位)、家庭更衣室",
        "殘疾人士專用設施: 方便通往池面的無阻通道、更衣室、洗手間"
      ],
      opening_schedule: [
        "夏季（4月至10月",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至5時",
        "第三節：晚6時至10時",
        "(暫停開放時段：中午12時至下午1時；下午5時至下午6時)"
      ],
      temporary_closure_for_annual_maintenance: ["12月1日至翌年3月31日"],
      weekly_cleansing_day: [
        "逢周一",
        "(如每周大清潔日適逢公眾假期，游泳池會照常開放，而大清潔行動將安排在同周的周二進行) "
      ],
      notes: [
        "#	戶外暖水游泳池",
        "^ 	室內暖水游泳池",
        "+ 	辦公時間內 (地區康樂事務辦事處)",
        "() 	設施的數目",
        "* 	設有專供殘疾人士使用的升降台 "
      ]
    },
    morsepark: {
      venue: "摩士公園游泳池",
      address: ["九龍黃大仙鳳舞街80號"],
      enquiries: ["2320 2023, 2324 1795 +"],
      facilities: [
        "主池、*副池、習泳池(3)、跳水池(只供團體租用)、兒童池、戲水池(2)、觀眾看台(800個座位)、電子計分板、家庭更衣室",
        "殘疾人士專用設施: 方便通往池面的無阻通道、更衣室、洗手間"
      ],
      opening_schedule: [
        "夏季（4月至10月",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至5時30分",
        "第三節：晚上6時30分至10時",
        "(暫停開放時段: 中午12時至下午1時；下午5時30分至下午6時30分)"
      ],
      temporary_closure_for_annual_maintenance: ["11月1日至翌年3月31日"],
      weekly_cleansing_day: [
        "由於2012年4月4日（周三）及4月6日（周五）為公眾假期，原定的每周大清潔行動將改在4月5日（周四）進行。游泳池在4月4日及4月6日會照常開放。",
        "逢周五",
        "(如每周大清潔日適逢公眾假期，游泳池會照常開放，而大清潔行動將安排在同周的周三進行) "
      ],
      notes: [
        "#	戶外暖水游泳池",
        "^ 	室內暖水游泳池",
        "+ 	辦公時間內 (地區康樂事務辦事處)",
        "() 	設施的數目",
        "* 	設有專供殘疾人士使用的升降台 "
      ]
    },
    hammerhillroad: {
      venue: "斧山道游泳池",
      address: ["九龍黃大仙龍翔道30號"],
      enquiries: ["2350 6173，2350 6062 +"],
      facilities: [
        "室內設施: *訓練池、嬉水池、家庭更衣室",
        "室外設施: 戲水池、嬉水池、韻律噴泉",
        "殘疾人士專用設施: 方便通往池面的無阻通道、更衣室、洗手間"
      ],
      opening_schedule: [
        "夏季（4月至10月",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至5時30分 ",
        "第三節：晚上6時30分至10時 ",
        "(暫停開放時段: 中午12時至下午1時；下午5時30分至下午6時30分)",
        "冬季 (11月至3月) ( 只開放室內游泳池^ )",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至5時30分",
        "第三節：晚上6時30分至9時",
        "(暫停開放時段 : 中午 12 時至下午1時；下午5時30分至下午6時30分)"
      ],
      temporary_closure_for_annual_maintenance: ["室內游泳池：4月16日至6月15日",
        "室外游泳池：11月1日至翌年3月31日"],
      weekly_cleansing_day: [
        "逢周一",
        "(如每周大清潔日適逢公眾假期，游泳池會照常開放，而大清潔行動將安排在同周的周二進行) "
      ],
      notes: [
        "#	戶外暖水游泳池",
        "^ 	室內暖水游泳池",
        "+ 	辦公時間內 (地區康樂事務辦事處)",
        "() 	設施的數目",
        "* 	設有專供殘疾人士使用的升降台 "
      ]
    },
    jordanvalley: {
      venue: "佐敦谷游泳池",
      address: ["九龍牛頭角彩霞道"],
      enquiries: ["2305 5919，2797 3177 +"],
      facilities: [
        "*訓練池、嬉水池(4)、家庭更衣室",
        "殘疾人士專用設施: 方便通往池面的無阻通道、更衣室、洗手間"
      ],
      opening_schedule: [
        "夏季（4月至10月",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至6時",
        "第三節：晚7時至10時",
        "(暫停開放時段：中午12時至下午1時；下午6時至下午7時)"
      ],
      temporary_closure_for_annual_maintenance: ["11月1日至翌年3月31日"],
      weekly_cleansing_day: [
        "逢周二",
        "(如每周大清潔日適逢公眾假期，游泳池會照常開放，而大清潔行動將安排在同周的周四進行) "
      ],
      notes: [
        "#	戶外暖水游泳池",
        "^ 	室內暖水游泳池",
        "+ 	辦公時間內 (地區康樂事務辦事處)",
        "() 	設施的數目",
        "* 	設有專供殘疾人士使用的升降台 "
      ]
    },
    kwuntong: {
      venue: "觀塘游泳池",
      address: ["九龍觀塘佳廉道10號"],
      enquiries: ["2717 9022，2797 3177 +"],
      facilities: [
        "主池、副池、習泳池、兒童池、戲水池、觀眾看台(800個座位)、電子計分板、家庭更衣室",
        "殘疾人士專用設施: 方便通往池面的無阻通道、更衣室、洗手間"
      ],
      opening_schedule: [
        "夏季（4月至10月",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至6時",
        "第三節：晚7時至10時",
        "(暫停開放時段：中午12時至下午1時；下午6時至下午7時)"
      ],
      temporary_closure_for_annual_maintenance: ["11月1日至翌年3月31日"],
      weekly_cleansing_day: [
        "逢周三",
        "(如每周大清潔日適逢公眾假期，游泳池會照常開放，而大清潔行動將安排在同周的周四進行) "
      ],
      notes: [
        "#	戶外暖水游泳池",
        "^ 	室內暖水游泳池",
        "+ 	辦公時間內 (地區康樂事務辦事處)",
        "() 	設施的數目",
        "* 	設有專供殘疾人士使用的升降台 "
      ]
    },
    muiwo: {
      venue: "梅窩游泳池",
      address: ["大嶼山梅窩銀石街5號"],
      enquiries: ["2984 2496，2852 3220 +"],
      facilities: [
        "訓練池、觀眾看台(120個座位)、家庭更衣室",
        "殘疾人士專用設施: 方便通往池面的無阻通道、更衣室、洗手間"
      ],
      opening_schedule: [
        "夏季（4月至10月",
        "第一節：上午8時30分至中午12時",
        "第二節：下午1時至6時30分",
        "第三節：晚上7時30分至10時",
        "(暫停開放時段：中午12時至下午1時；下午6時30分至下午7時30分)"
      ],
      temporary_closure_for_annual_maintenance: ["11月1日至翌年3月31日"],
      weekly_cleansing_day: [
        "逢周五",
        "(如每周大清潔日適逢公眾假期，游泳池會照常開放，而大清潔行動將安排在同周的周四進行)"
      ],
      notes: [
        "^ 	室內暖水游泳池",
        "+ 	辦公時間內 (地區康樂事務辦事處)",
        "() 	設施的數目",
        "* 	設有專供殘疾人士使用的升降台 "
      ]
    },
    tungchung: {
      venue: "東涌游泳池",
      address: ["東涌達東路5號"],
      enquiries: ["2109 9107，2852 3220 +"],
      facilities: [
        "室內設施: *主池、觀眾看台(1,000個座位)、電子計分板、家庭更衣室",
        "室外設施: *訓練池",
        "殘疾人士專用設施: 方便通往池面的無阻通道、更衣室、洗手間"
      ],
      opening_schedule: [
        "夏季（4月至10月",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至6時30分",
        "第三節：晚上7時30分至10時",
        "(暫停開放時段：中午12時至下午1時；下午6時30分至7時30分)",
        "冬季 (11月至3月) ( 只開放室內游泳池^ )",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至6時",
        "第三節：晚上7時至9時30分",
        "(暫停開放時段：中午12時至下午1時；下午6時至7時)"
      ],
      temporary_closure_for_annual_maintenance: ["主池： 9月11日至10月31日",
        "訓練池： 11月1日至翌年3月31日"],
      weekly_cleansing_day: [
        "逢周二",
        "(如每周大清潔日適逢公眾假期，游泳池會照常開放，而大清潔行動將安排在同周的周三進行)"
      ],
      notes: [
        "^ 	室內暖水游泳池",
        "+ 	辦公時間內 (地區康樂事務辦事處)",
        "() 	設施的數目",
        "* 	設有專供殘疾人士使用的升降台 "
      ]
    },
    jockeyclubyanoitong: {
      venue: "賽馬會仁愛堂游泳池",
      address: ["屯門青松觀路"],
      enquiries: ["2464 7149，2464 6561 +"],
      facilities: [
        "嬉水池(2)"
      ],
      opening_schedule: [
        "夏季（4月至10月",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至6時30分",
        "第三節：晚上7時30分至10時",
        "(暫停開放時段：中午12時至下午1時；下午6時30分至7時30分)"
      ],
      temporary_closure_for_annual_maintenance: ["11月1日至翌年3月31日"],
      weekly_cleansing_day: [
        "逢周二",
        "(如每周大清潔日適逢公眾假期，游泳池會照常開放，而大清潔行動將安排在同周的周一進行)"
      ],
      notes: [
        "^ 	室內暖水游泳池",
        "+ 	辦公時間內 (地區康樂事務辦事處)",
        "() 	設施的數目",
        "* 	設有專供殘疾人士使用的升降台 "
      ]
    },
    tuenmun: {
      venue: "屯門游泳池",
      address: ["屯門海皇路"],
      enquiries: ["2458 8022，2451 1159 +"],
      facilities: [
        "主池、副池、訓練池、習泳池(2)、跳水池、戲水池、觀眾看台(700個座位)、家庭更衣室",
        "殘疾人士專用設施: 方便通往池面的無阻通道、更衣室、洗手間"
      ],
      opening_schedule: [
        "夏季（4月至10月",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至6時30分",
        "第三節：晚上7時30分至10時",
        "(暫停開放時段：中午12時至下午1時；下午6時30分至7時30分)",
        "冬季 (11月至1月中) (只開放主池 # )",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至6時",
        "第三節：晚上7時至9時30分",
        "(暫停開放時段：中午12時至下午1時；下午6時至7時)"
      ],
      temporary_closure_for_annual_maintenance: ["全泳館：2012年1月16日至3月15日",
        "副池、訓練池、習泳池、跳水池、戲水池﹕11月1日至翌年3月31日"],
      weekly_cleansing_day: [
        "逢周四",
        "(如每周大清潔日適逢公眾假期，游泳池會照常開放，而大清潔行動將安排在同周的周五進行)"
      ],
      notes: [
        "^ 	室內暖水游泳池",
        "+ 	辦公時間內 (地區康樂事務辦事處)",
        "() 	設施的數目",
        "* 	設有專供殘疾人士使用的升降台 "
      ]
    },
    tinshuiwai: {
      venue: "天水圍游泳池",
      address: ["天水圍天柏路1號"],
      enquiries: ["2446 9057，2446 1103"],
      facilities: [
        "訓練池、習泳池、嬉水池、家庭更衣室",
        "殘疾人士專用設施: 方便通往池面的無阻通道、更衣室、洗手間"
      ],
      opening_schedule: [
        "夏季（4月至10月)",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至6時30分",
        "第三節：晚上7時30分至10時",
        "(暫停開放時段：中午12時至下午1時；下午6時30分至7時30分)"
      ],
      temporary_closure_for_annual_maintenance: ["11月1日至翌年3月31日"],
      weekly_cleansing_day: [
        "逢周四",
        "(如每周大清潔日適逢公眾假期，游泳池會照常開放，而大清潔行動將安排在同周的周五進行)"
      ],
      notes: [
        "^ 	室內暖水游泳池",
        "+ 	辦公時間內 (地區康樂事務辦事處)",
        "() 	設施的數目",
        "* 	設有專供殘疾人士使用的升降台 "
      ]
    },
    yuenlong: {
      venue: "元朗游泳池",
      address: ["元朗體育路10號"],
      enquiries: ["2475 0184，2449 3506"],
      facilities: [
        "主池、副池、訓練池、跳水池、觀眾看台(700個座位)、家庭更衣室",
        "幼童池 (水深0.5米以下) 於六月至八月免費開放",
        "殘疾人士專用設施: 方便通往池面的無阻通道、更衣室、洗手間"
      ],
      opening_schedule: [
        "夏季（4月至10月)",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至6時30分",
        "第三節：晚上7時30分至10時",
        "(暫停開放時段：中午12時至下午1時；下午6時30分至7時30分)",
        "冬季 (11月至2月中) (只開放主池 #)",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至6時",
        "第三節：晚上7時至9時30分",
        "(暫停開放時段：中午12時至下午1時；下午6時至7時)"
      ],
      temporary_closure_for_annual_maintenance: ["副池、訓練池、跳水池﹕ 11月1日至翌年3月31日",
        "主池：2012年2月16日至7月15日"],
      weekly_cleansing_day: [
        "逢周三",
        "(如每周大清潔日適逢公眾假期，游泳池會照常開放，而大清潔行動將安排在同周的周二進行)"
      ],
      notes: [
        "^ 	室內暖水游泳池",
        "+ 	辦公時間內 (地區康樂事務辦事處)",
        "() 	設施的數目",
        "* 	設有專供殘疾人士使用的升降台 "
      ]
    },
    pingshan: {
      venue: "屏山天水圍游泳池",
      address: ["天水圍聚星路1號 "],
      enquiries: ["2856 2244，2856 1739"],
      facilities: [
        "訓練池、家庭更衣室",
        "殘疾人士專用設施: 方便通往池面的無阻通道、更衣室、洗手間"
      ],
      opening_schedule: [
        "夏季（4月至10月",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至6時30分",
        "第三節：晚上7時30分至10時",
        "(暫停開放時段：中午12時至下午1時；下午6時30分至7時30分)",
        "冬季 (11月至3月^)",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至6時",
        "第三節：晚上7時至9時30分",
        "(暫停開放時段：中午12時至下午1時；下午6時至7時)"
      ],
      temporary_closure_for_annual_maintenance: ["待定"],
      weekly_cleansing_day: [
        "逢周一",
        "(如每周大清潔日適逢公眾假期，游泳池會照常開放，而大清潔行動將安排在同周的周二進行)"
      ],
      notes: [
        "^ 	室內暖水游泳池",
        "+ 	辦公時間內 (地區康樂事務辦事處)",
        "() 	設施的數目",
        "* 	設有專供殘疾人士使用的升降台 "
      ]
    },
    shingmunvalley: {
      venue: "城門谷游泳池",
      address: ["荃灣城門道21號"],
      enquiries: ["2416 0522，2414 8985，2212 9738 +"],
      facilities: [
        "室內設施: @主池、觀眾看台(1000個座位)、電子計分板、家庭更衣室",
        "室外設施: 訓練池、習泳池、嬉水池(3)",
        "殘疾人士專用設施: 方便通往池面的無阻通道、更衣室、洗手間"
      ],
      opening_schedule: [
        "夏季（4月至10月)",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至6時30分",
        "第三節：晚上7時30分至10時",
        "(暫停開放時段：中午12時至下午1時；下午6時30分至7時30分)",
        "冬季 (11月至3月) (只開放室內游泳池^ )",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至6時",
        "第三節：晚上7時至9時30分",
        "(暫停開放時段：中午12時至下午1時；下午6時至7時)"
      ],
      temporary_closure_for_annual_maintenance: ["主池：5月1日至6月30日",
        "訓練池、習泳池、嬉水池：11月1日至翌年3月31日"],
      weekly_cleansing_day: [
        "逢周一",
        "(如每周大清潔日適逢公眾假期，游泳池會照常開放，而大清潔行動將安排在同周的周三進行)"
      ],
      notes: [
        "^ 	室內暖水游泳池",
        "+ 	辦公時間內 (地區康樂事務辦事處)",
        "() 	設施的數目",
        "* 	設有專供殘疾人士使用的升降台 ",
        "@	城門谷游游泳池內主池水深2米的範圍設有供殘疾人士使用的上落水升降台"
      ]
    },
    tsuenkingcircuit: {
      venue: "荃景圍胡忠游泳池",
      address: ["荃灣荃景圍178號"],
      enquiries: ["2413 5523，2212 9738 +"],
      facilities: [
        "訓練池、兒童池、嬉水池、家庭更衣室",
        "殘疾人士專用設施: 方便通往池面的無阻通道、更衣室、洗手間"
      ],
      opening_schedule: [
        "夏季（4月至10月)",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至6時30分",
        "第三節：晚上7時30分至10時",
        "(暫停開放時段：中午12時至下午1時；下午6時30分至7時30分)"
      ],
      temporary_closure_for_annual_maintenance: ["11月1日至翌年3月31日"],
      weekly_cleansing_day: [
        "逢周二",
        "(如每周大清潔日適逢公眾假期，游泳池會照常開放，而大清潔行動將安排在同周的周三進行)"
      ],
      notes: [
        "^ 	室內暖水游泳池",
        "+ 	辦公時間內 (地區康樂事務辦事處)",
        "() 	設施的數目",
        "* 	設有專供殘疾人士使用的升降台 "
      ]
    },
    kwaishing: {
      venue: "葵盛游泳池",
      address: ["葵涌葵盛圍306號"],
      enquiries: ["2426 2081，2424 7201+"],
      facilities: [
        "主池、副池、習泳池(3)、跳水池、兒童池、觀眾看台(700個座位)、電子計分板、家庭更衣室",
        "殘疾人士專用設施: 方便通往池面的無阻通道、更衣室、洗手間"
      ],
      opening_schedule: [
        "夏季（4月至10月)",
        "葵盛游泳池副池將於4月1日至20日期間暫停開放，以進行喉管維修工程。期間，市民仍可使用該場館的主池、習泳池、兒童池及跳水池。",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至6時30分",
        "第三節：晚上7時30分至10時",
        "(暫停開放時段：中午12時至下午1時；下午6時30分至7時30分)"
      ],
      temporary_closure_for_annual_maintenance: ["11月1日至翌年3月31日"],
      weekly_cleansing_day: [
        "逢周五",
        "(如每周大清潔日適逢公眾假期，游泳池會照常開放，而大清潔行動將安排在同周的周二進行)"
      ],
      notes: [
        "^ 	室內暖水游泳池",
        "+ 	辦公時間內 (地區康樂事務辦事處)",
        "() 	設施的數目",
        "* 	設有專供殘疾人士使用的升降台 "
      ]
    },
    northkwaichung: {
      venue: "北葵涌賽馬會游泳池",
      address: ["葵涌和宜合道290號"],
      enquiries: ["2422 1779，2424 7201 +"],
      facilities: [
        "主池、習泳池(2)、跳水池、家庭更衣室",
        "幼童池 (水深0.5米以下) 於六月至八月免費開放",
        "殘疾人士專用設施: 方便通往池面的無阻通道、更衣室、洗手間"
      ],
      opening_schedule: [
        "夏季（4月至10月",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至6時30分",
        "第三節：晚上7時30分至10時",
        "(暫停開放時段：中午12時至下午1時；下午6時30分至7時30分)"
      ],
      temporary_closure_for_annual_maintenance: ["11月1日至翌年3月31日"],
      weekly_cleansing_day: [
        "逢周三",
        "(如每周大清潔日適逢公眾假期，游泳池會照常開放，而大清潔行動將安排在同周的周二進行)"
      ],
      notes: [
        "^ 	室內暖水游泳池",
        "+ 	辦公時間內 (地區康樂事務辦事處)",
        "() 	設施的數目",
        "* 	設有專供殘疾人士使用的升降台 "
      ]
    },
    tsingyi: {
      venue: "青衣游泳池",
      address: ["青衣青敬路"],
      enquiries: ["2435 6407，2424 7201 +"],
      facilities: [
        "主池、習泳池、戲水池、嬉水池、觀眾看台(974個座位)、電子計分板、家庭更衣室",
        "殘疾人士專用設施: 方便通往池面的無阻通道、更衣室、洗手間"
      ],
      opening_schedule: [
        "夏季（4月至10月",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至6時30分",
        "第三節：晚上7時30分至10時",
        "(暫停開放時段：中午12時至下午1時；下午6時30分至7時30分)"
      ],
      temporary_closure_for_annual_maintenance: ["11月1日至翌年3月31日"],
      weekly_cleansing_day: [
        "逢周四",
        "(如每周大清潔日適逢公眾假期，游泳池會照常開放，而大清潔行動將安排在同周的周二進行)"
      ],
      notes: [
        "^ 	室內暖水游泳池",
        "+ 	辦公時間內 (地區康樂事務辦事處)",
        "() 	設施的數目",
        "* 	設有專供殘疾人士使用的升降台 "
      ]
    },
    fanling: {
      venue: "粉嶺游泳池",
      address: ["粉嶺新運路73號"],
      enquiries: ["2675 6951，2679 2863 +"],
      facilities: [
        "*主池、*副池、訓練池、戲水池、觀眾看台(850個座位)、家庭更衣室",
        "殘疾人士專用設施: 方便通往池面的無阻通道、更衣室、洗手間"
      ],
      opening_schedule: [
        "夏季（4月至10月",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至6時30分",
        "第三節：晚上7時30分至10時",
        "(暫停開放時段：中午12時至下午1時；下午6時30分至7時30分)",
        "冬季 (11月至3月) (只開放主池 # )",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至6時",
        "第三節：晚上7時至9時30分",
        "(暫停開放時段：中午12時至下午1時；下午6時至7時)"
      ],
      temporary_closure_for_annual_maintenance: ["主池：4月16日至5月31日",
        "副池、訓練池、戲水池：11月1日至翌年3月31日"],
      weekly_cleansing_day: [
        "逢周二",
        "(如每周大清潔日適逢公眾假期，游泳池會照常開放，而大清潔行動將安排在同周的周三進行)"
      ],
      notes: [
        "#	戶外暖水游泳池",
        "^ 	室內暖水游泳池",
        "+ 	辦公時間內 (地區康樂事務辦事處)",
        "() 	設施的數目",
        "* 	設有專供殘疾人士使用的升降台 "
      ]
    },
    sheungshui: {
      venue: "上水游泳池",
      address: ["上水天平路38號"],
      enquiries: ["2679 4844，2679 2863 +"],
      facilities: [
        "*主池、*副池、訓練池、戲水池、觀眾看台(850個座位)、家庭更衣室",
        "殘疾人士專用設施: 方便通往池面的無阻通道、更衣室、洗手間"
      ],
      opening_schedule: [
        "夏季（4月至10月",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至6時30分",
        "第三節：晚上7時30分至10時",
        "(暫停開放時段：中午12時至下午1時；下午6時30分至7時30分)"
      ],
      temporary_closure_for_annual_maintenance: ["11月1日至翌年3月31日"],
      weekly_cleansing_day: [
        "逢周四",
        "(如每周大清潔日適逢公眾假期，游泳池會照常開放，而大清潔行動將安排在同周的周三進行)"
      ],
      notes: [
        "^ 	室內暖水游泳池",
        "+ 	辦公時間內 (地區康樂事務辦事處)",
        "() 	設施的數目",
        "* 	設有專供殘疾人士使用的升降台 "
      ]
    },
    taipo: {
      venue: "大埔游泳池",
      address: ["大埔汀太路11號"],
      enquiries: ["2661 2244，2665 5058 +"],
      facilities: [
        "主池、習泳池(2)、跳水池、嬉水池(2)、兒童池、 觀眾看台(800個座位)、電子計分板、家庭更衣室",
        "殘疾人士專用設施: 方便通往池面的無阻通道、更衣室、洗手間"
      ],
      opening_schedule: [
        "夏季（4月至10月",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至6時30分",
        "第三節：晚上7時30分至10時",
        "(暫停開放時段：中午12時至下午1時；下午6時30分至7時30分)"
      ],
      temporary_closure_for_annual_maintenance: ["11月1日至翌年3月31日"],
      weekly_cleansing_day: [
        "逢周一",
        "(如每周大清潔日適逢公眾假期，游泳池會照常開放，而大清潔行動將安排在同周的周三進行)"
      ],
      notes: [
        "^ 	室內暖水游泳池",
        "+ 	辦公時間內 (地區康樂事務辦事處)",
        "() 	設施的數目",
        "* 	設有專供殘疾人士使用的升降台 "
      ]
    },
    hintin: {
      venue: "顯田游泳池",
      address: ["沙田大圍車公廟路68號"],
      enquiries: ["2607 3423，2634 0111 +"],
      facilities: [
        "室內設施：*主池、按摩池、觀眾看台(250個座位)、家庭更衣室",
        "室外設施：訓練池、嬉水池、按摩池",
        "殘疾人士專用設施: 方便通往池面的無阻通道、更衣室、洗手間"
      ],
      opening_schedule: [
        "夏季（4月至10月)",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至6時30分",
        "第三節：晚上7時30分至10時",
        "(暫停開放時段：中午12時至下午1時；下午6時30分至7時30分)",
        "冬季 (11月至3月) ( 只開放室內游泳池^ )",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至6時",
        "第三節：晚上7時至9時30分",
        "(暫停開放時段：中午12時至下午1時；下午6時至7時)"
      ],
      temporary_closure_for_annual_maintenance: ["主池及室內按摩池：9月11日至10月31日",
        "訓練池、嬉水池、室外按摩池：11月1日至翌年3月31日"],
      weekly_cleansing_day: [
        "逢周四",
        "(如每周大清潔日適逢公眾假期，游泳池會照常開放，而大清潔行動將安排在同周的周三進行)"
      ],
      notes: [
        "^ 	室內暖水游泳池",
        "+ 	辦公時間內 (地區康樂事務辦事處)",
        "() 	設施的數目",
        "* 	設有專供殘疾人士使用的升降台 "
      ]
    },
    maonshan: {
      venue: "馬鞍山游泳池",
      address: ["馬鞍山鞍駿街33號"],
      enquiries: ["2641 0776，2634 0111+"],
      facilities: [
        "主池、*訓練池、*習泳池(2)、嬉水池(3)、觀眾看台(1200個座位)、電子計分板、家庭更衣室",
        "殘疾人士專用設施: 方便通往池面的無阻通道、更衣室、洗手間"
      ],
      opening_schedule: [
        "夏季（4月至10月)",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至6時30分",
        "第三節：晚上7時30分至10時",
        "(暫停開放時段：中午12時至下午1時；下午6時30分至7時30分)"
      ],
      temporary_closure_for_annual_maintenance: ["11月1日至翌年3月31日"],
      weekly_cleansing_day: [
        "逢周二",
        "(如每周大清潔日適逢公眾假期，游泳池會照常開放，而大清潔行動將安排在同周的周一進行)"
      ],
      notes: [
        "#	戶外暖水游泳池",
        "^ 	室內暖水游泳池",
        "+ 	辦公時間內 (地區康樂事務辦事處)",
        "() 	設施的數目",
        "* 	設有專供殘疾人士使用的升降台 "
      ]
    },
    shatinjockeyclub: {
      venue: "沙田賽馬會游泳池",
      address: ["沙田源禾路10號"],
      enquiries: ["2693 6613，2634 0111 +"],
      facilities: [
        "*主池、副池、訓練池、習泳池(2)、跳水池、兒童池、觀眾看台(700個座位)、電子計分板、家庭更衣室",
        "幼童池 (水深0.5米以下) 於六月至八月免費開放",
        "殘疾人士專用設施: 方便通往池面的無阻通道、更衣室、洗手間"
      ],
      opening_schedule: [
        "夏季（4月至10月)",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至6時30分",
        "第三節：晚上7時30分至10時",
        "(暫停開放時段：中午12時至下午1時；下午6時30分至7時30分)",
        "冬季 (11月至3月) (只開放主池 #)",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至6時",
        "第三節：晚上7時至9時30分",
        "(暫停開放時段：中午12時至下午1時；下午6時至7時)"
      ],
      temporary_closure_for_annual_maintenance: ["主池、跳水池：4月1日至5月21日",
        "副池、訓練池、習泳池、跳水池、兒童池：11月1日至翌年3月31日"],
      weekly_cleansing_day: [
        "由於2012年4月4日（周三）及4月6日（周五）為公眾假期，原定的每周大清潔行動將會取消。游泳池在4月4日及4月6日會照常開放。",
        "逢周五",
        "(如大清潔日適逢公眾假期，泳池會照常開放，而大清潔行動將安排在同周的周三進行)"
      ],
      notes: [
        "#	戶外暖水游泳池",
        "^ 	室內暖水游泳池",
        "+ 	辦公時間內 (地區康樂事務辦事處)",
        "() 	設施的數目",
        "* 	設有專供殘疾人士使用的升降台 "
      ]
    },
    saikung: {
      venue: "西貢游泳池",
      address: ["西貢惠民路"],
      enquiries: ["2792 7285，2791 3100 +"],
      facilities: [
        "主池、習泳池、嬉水池、觀眾看台(450個座位)",
        "殘疾人士專用設施: 方便通往池面的無阻通道、更衣室、洗手間"
      ],
      opening_schedule: [
        "夏季（4月至10月",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至6時30分",
        "第三節：晚上7時30分至10時",
        "(暫停開放時段：中午12時至下午1時；下午6時30分至7時30分)"
      ],
      temporary_closure_for_annual_maintenance: ["11月1日至翌年3月31日"],
      weekly_cleansing_day: [
        "逢周三",
        "(如每周大清潔日適逢公眾假期，游泳池會照常開放，而大清潔行動將安排在同周的周四進行)"
      ],
      notes: [
        "^ 	室內暖水游泳池",
        "+ 	辦公時間內 (地區康樂事務辦事處)",
        "() 	設施的數目",
        "* 	設有專供殘疾人士使用的升降台 "
      ]
    },
    tseungkwano: {
      venue: "將軍澳游泳池",
      address: ["將軍澳運隆路9號"],
      enquiries: ["2706 7646，2706 6767+"],
      facilities: [
        "*主池、*訓練池、習泳池(2)、跳水池、戲水池、嬉水池(2)、觀眾看台(1155個座位)、電子計分板、家庭更衣室",
        "殘疾人士專用設施: 方便通往池面的無阻通道、更衣室、洗手間"
      ],
      opening_schedule: [
        "夏季（4月至10月)",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至6時30分",
        "第三節：晚上7時30分至10時",
        "(暫停開放時段：中午12時至下午1時；下午6時30分至7時30分)",
        "冬季 (11月至3月) (只開放主池 # )",
        "第一節：上午6時30分至中午12時",
        "第二節：下午1時至6時",
        "第三節：晚上7時至9時30分",
        "(暫停開放時段 : 中午 12 時至下午1時；下午6時至下午7時)"
      ],
      temporary_closure_for_annual_maintenance: ["主池： 2013年4月至5月",
        "訓練池、習泳池、跳水池、戲水池、嬉水池：11月1日至翌年3月31日"],
      weekly_cleansing_day: [
        "逢周一",
        "(如每周大清潔日適逢公眾假期，游泳池會照常開放，而大清潔行動將安排在同周的周二進行)"
      ],
      notes: [
        "#	戶外暖水游泳池",
        "^ 	室內暖水游泳池",
        "+ 	辦公時間內 (地區康樂事務辦事處)",
        "() 	設施的數目",
        "* 	設有專供殘疾人士使用的升降台 "
      ]
    }
  };
})(swim);